Revit 2027 API
RebarDeformationType Enumeration
 Bar deformation type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarDeformationType
Public Enumeration RebarDeformationType
public enum class RebarDeformationType
type RebarDeformationType
Members
Member name | Value | Description
Deformed | 0 |  The bar is ribbed.
Plain | 1 |  The bar is not ribbed.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace